---
type: UpdaterData
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# UpdaterData

`Autodesk.Revit.DB.UpdaterData` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetAddedElementIds | 2011 | `public ICollection < ElementId > GetAddedElementIds ()` |
| Method | GetDeletedElementIds | 2011 | `public ICollection < ElementId > GetDeletedElementIds ()` |
| Method | GetDocument | 2011 | `public Document GetDocument ()` |
| Method | GetModifiedElementIds | 2011 | `public ICollection < ElementId > GetModifiedElementIds ()` |
| Method | IsChangeTriggered | 2011 | `public bool IsChangeTriggered ( ElementId id , ChangeType type )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |